// @ts-ignore
import companyDetail from '@company/companyDetail.json'

export const COUPON_CARD_DETAILS = {
  propertytype: 'คูปอง',
  status: 'ACTIVE',
  jobtype: 'Coupon',
  projectName: `ส่วนลดโครงการใน ${companyDetail.companyNameEn}`,
  startingPrice: 100,
  sharequote: `มาแล้ว!! ส่วนลดโครงการใน ${companyDetail.companyNameEn} มูลค่า 100,000 บาท แต่ราคาเริ่มต้นเพียง 100 บาทเท่านั้น สนใจลงทะเบียนสั่งซื้อ คลิกเลย`,
  fb: 'https://go.baania.com/43c70874/',
  tw: 'https://go.baania.com/15870737/',
  line: 'https://go.baania.com/43c70877/',
  copy_link: 'https://go.baania.com/1587073a/'
}

export const COUPON_CONDITONS = [
  `คูปองส่วนลดมูลค่า 100,000 บาท สำหรับการซื้ออสังหาริมทรัพย์ที่ร่วมรายการผ่าน ${companyDetail.websiteLink} เท่านั้น`,
  `* เฉพาะโครงการในดีลพิเศษ สำหรับ ${companyDetail.companyNameEn} และโครงการที่น่าสนใจ เท่านั้น ไม่รวมโครงการบ้านสวยมือสองและห้องเช่า`,
  'ระยะเวลาการใช้คูปอง ตั้งแต่วันที่ 1 เมษายน - 30 มิถุนายน 2565',
  'คูปองส่วนลด 1 สิทธิ์ สามารถใช้เป็นส่วนลด 100,000 บาท ต่อการจอง 1 ห้อง เท่านั้น',
  'คูปองส่วนลดนี้ สามารถโอนสิทธิ์ให้ผู้อื่นได้ แต่ไม่สามารถโอน/เปลี่ยน/แลก/ทอน เป็นเงินสดได้',
  'กรณีที่มีการยกเลิกการจอง ที่มีการใช้คูปองส่วนลดร่วมด้วย คูปองจะไม่สามารถนำกลับมาใช้ใหม่ได้',
  'คูปองส่วนลดนี้สามารถใช้ได้เพียงครั้งเดียว โดยผู้ใช้งานจะต้องแสดงคูปองส่วนลดกับพนักงานฝ่ายขายก่อนทำการจองเท่านั้น'
]
